Autodesk.Revit.DB.BuiltInFailures.SectionViewFailures.ScopeBoxBehindSection
Section may not be associated to a scope box which lies behind it.

Autodesk.Revit.DB.BuiltInFailures.SectionViewFailures
Failures about Section.